# DimensionSegmentArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegmentArray Constructor
DimensionSegmentArray Class See Also
---
Initializes a new instance of the DimensionSegmentArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DimensionSegmentArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DimensionSegmentArray()
```

# See Also
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace